export const LINES = [
  "전체",
  "1호선",
  "2호선",
  "3호선",
  "4호선",
  "5호선",
  "6호선",
  "7호선",
  "8호선",
  "9호선",
];

export const stationsByLineWithoutAll: Record<string, string[]> = {
  "1호선": ["제기동역", "동묘앞역", "신설동역", "외대앞역", "남영역"],
  "2호선": [
    "문래역",
    "아현역",
    "한양대역",
    "잠실나루역",
    "양천구청역",
    "신정네거리역",
  ],
  "3호선": ["독립문역", "무악재역", "금호역", "옥수역", "잠원역"],
  "4호선": ["한성대입구역", "성신여대입구역", "수유역", "이촌역", "동작역"],
  "5호선": [
    "마장역",
    "애오개역",
    "신금호역",
    "아차산역",
    "영등포시장역",
    "방이역",
  ],
  "6호선": [
    "보문역",
    "창신역",
    "효창공원앞역",
    "광흥창역",
    "월드컵경기장역",
    "고려대역",
  ],
  "7호선": [
    "공릉역",
    "어린이대공원역",
    "용마산역",
    "자양역",
    "하계역",
    "남성역",
  ],
  "8호선": ["암사역", "몽촌토성역", "강동구청역", "송파역", "석촌역"],
  "9호선": [
    "노들역",
    "선유도역",
    "한성백제역",
    "양천향교역",
    "흑석역",
    "공항시장역",
  ],
};

export const stationsByLine: Record<string, string[]> = {
  전체: Object.values(stationsByLineWithoutAll).flat(),
  ...stationsByLineWithoutAll,
};
